s3ptar/HomeServer/Firmware/Cypress/PSoC_Eve-master/PSoC_Eve-master/PSoC_Eve_Library/PSoCEve_List.c
/* ========================================
 *
 * Copyright YOUR COMPANY, THE YEAR
 * All Rights Reserved
 * UNPUBLISHED, LICENSED SOFTWARE.
 *
 * CONFIDENTIAL AND PROPRIETARY INFORMATION
 * WHICH IS THE PROPERTY OF your company.
 *
 * ========================================
*/

#include "PSoCEve.h"
//#include "PSoCEve_List.h"
#include "PSoCEve_Hal.h"
//#include "SST25VF032B.h"

//enum LISTTYPE transferinprogress = NONE;
uint32 ramPtr;
uint16 ramCMDOffset;

TRANSFERTYPE transferinprogress = NONE;

#if defined EVE_FT800
    uint8 vertexFormat = VERTEX_FORMAT_1_16;
#endif    

/*******************************************************************************
*   Macros.
*******************************************************************************/

/* Macro name : CheckCMDOffset
   Description: Control roll-over to command list ram in FT chip.
*/
#define CheckCMDOffset() if (ramCMDOffset > 4095) { ramCMDOffset = (ramCMDOffset - 4096); }


/*******************************************************************************
*   Function prototypes.
*******************************************************************************/
uint8 FTIsCoproReady(uint16 *newoffset);

void DLListNewItem(uint32 item);
void CMDListNewItem(uint8 *tobesent, uint8 length, unsigned char *string);

extern void DLBitmapSource(uint32 address);
extern void DLClearColorRGB(uint8 red, uint8 green, uint8 blue);    
extern void DLTag(uint8 tag);
extern void DLColorRGB(uint8 red, uint8 green, uint8 blue);
extern void DLBitmapHandle(uint8 handle);
extern void DLCell(uint8 cell);
extern void DLBitmapLayout(uint8 format, uint16 linestride, uint16 height);
extern void DLBitmapSize(uint8 filter, uint8 wrapx, uint8 wrapy, uint16 width, uint16 height);
extern void DLAlphaFunc(uint8 func, uint8 ref);
extern void DLStencilFunc(uint8 func, uint8 ref, uint8 mask);
extern void DLBlendFunc(uint8 src, uint8 dst);
extern void DLStencilOp(uint8 sfail, uint8 spass);
extern void DLPointSize(uint32 size);
extern void DLLineWidth(uint16 width);
extern void DLColorA(uint8 alpha);
extern void DLClearStencil(uint8 s);
extern void DLClearTag(uint8 t);
extern void DLStencilMask(uint8 mask);
extern void DLTagMask(uint8 mask);
extern void DLBitmapTransformA(uint32 a);
extern void DLBitmapTransformB(uint32 b);
extern void DLBitmapTransformC(uint32 c);
extern void DLBitmapTransformD(uint32 d);
extern void DLBitmapTransformE(uint32 e);
extern void DLBitmapTransformF(uint32 f);
extern void DLScissorXY(uint16 x, uint16 y);
extern void DLJump(uint16 address);
extern void DLBegin(uint8 primitive);
extern void DLCall(uint16 address);
extern void DLColorMask(uint8 r, uint8 g, uint8 b, uint8 a);
extern void DLEnd();
extern void DLSaveContext();
extern void DLRestoreContext();
extern void DLReturn();
extern void DLMacro(uint8 macro);
extern void DLClear(uint8 color, uint8 stencil, uint8 tag);
extern void DLVertex2F(int16 x, int16 y);
extern void DLVertex2II(uint16 x, uint16 y, uint8 handle, uint8 cell);

extern void CMDDLStart();
extern void CMDSwap();
extern void CMDInterrupt(uint32 milliseconds);
extern void CMDBgcolor(int8 red, int8 green, int8 blue);
extern void CMDFgcolor(int8 red, int8 green, int8 blue);
extern void CMDGradient(int16 x0, int16 y0, int8 red0, int8 green0, int8 blue0, int16 x1, int16 y1, int8 red1, int8 green1, int8 blue1);
extern void CMDText(int16 x, int16 y, int16 font, int16 options, char* text);
extern void CMDButton(int16 x, int16 y, int16 width, int16 height, int16 font, int16 options, char* text);
extern void CMDKeys(int16 x, int16 y, int16 width, int16 height, int16 font, int16 options, char* text);
extern void CMDProgressBar(int16 x, int16 y, int16 width, int16 height, int16 options, int16 value, int16 range);
extern void CMDSlider(int16 x, int16 y, int16 width, int16 height, int16 options, int16 value, int16 range);
extern void CMDScrollBar(int16 x, int16 y, int16 width, int16 height, int16 options, int16 value, int16 size, int16 range);
extern void CMDToggle(int16 x, int16 y, int16 width, int16 font, int16 options, int16 state, char* text);
extern void CMDGauge(int16 x, int16 y, int16 radius, int16 options, int16 major, int16 minor, int16 value, int16 range);
extern void CMDClock(int16 x, int16 y, int16 radius, int16 options, int16 hours, int16 minutes, int16 seconds, int16 milliseconds);
extern void CMDCalibrate();
extern void CMDSpinner(int16 x, int16 y, int16 style, int16 scale);
extern void CMDStop();
extern void CMDMemSet(int32 ptr, int32 value, int32 size);
extern void CMDMemZero(int32 ptr, int32 size);
extern void CMDMemCopy(int32 dest, int32 src, int32 size);
extern void CMDAppend(int32 ptr, int32 size);
extern void CMDSnapshot(int32 ptr);
extern void CMDInflate(int32 ptr);
extern void CMDLoadIdentity();
extern void CMDTranslate(int32 tx, int32 ty);
extern void CMDScale(int32 x, int32 y);
extern void CMDRotate(int32 angle);
extern void CMDSetmatrix();
extern void CMDSetfont(int32 font, int32 ptr);
extern void CMDTrack(int16 x, int16 y, int16 width, int16 height, int16 tag);
extern void CMDDial(int16 x, int16 y, int16 radius, int16 options, int16 value);
extern void CMDNumber(int16 x, int16 y, int16 font, int16 options, int32 number);
extern void CMDScreenSaver();
extern void CMDSketch(int16 x, int16 y, int16 width, int16 height, int32 ptr, int16 format);
extern void CMDLogo();
extern void CMDColdstart();
extern void CMDGradcolor(int8 red, int8 green, int8 blue);


/*******************************************************************************
* Function Name: FTIsCoproccesorReady
********************************************************************************
*
* Summary:
*  Wrapper to FTIsCoproReady function.
*  Used with commands like CMD_CALIBRATE to know when command work have finished.
*
* Parameters:
*  none
*
* Return:
*  1, if coprocessor have finished proccesing commands list.
*  0, if coprocessor is busy.
*
*******************************************************************************/
uint8 FTIsCoproccesorReady()
{
    return FTIsCoproReady(&ramCMDOffset);
}

