s3ptar/HomeServer/Firmware/Cypress/PSoC_Eve-master/PSoC_Eve-master/PSoC_Eve_Library/PSoCEve_List.c
/*******************************************************************************
* Function Name: FTIsCoproReady
********************************************************************************
*
* Summary:
*  Check if coproccesor is ready to proccess a new commands list.
*
* Parameters:
*  newoffset:   pointer to variable to store offset to command list.
*
* Return:
*  1, if coproccesor is ready.
*  0, if coproccesor is busy proccessing a commands list.
*
*******************************************************************************/
uint8 FTIsCoproReady(uint16 *newoffset)
{
    unsigned int cmdbufferrd, cmdbufferwr;

    cmdbufferrd = FT_Register_Read(REG_CMD_READ);		    // Read the graphics processor read pointer.
	cmdbufferwr = FT_Register_Read(REG_CMD_WRITE); 	        // Read the graphics processor write pointer.
    
    if (cmdbufferrd != cmdbufferwr) return 0;               // If both are equal, processor have finished
    else                                                    //    processing previous list.
    {
        *newoffset = cmdbufferwr;
        return 1;                  
    }
}

uint16 FTGetCMDFifoFreeSpace()
{
    #if defined EVE_FT800
        unsigned int cmdbufferrd, cmdbufferwr;
        
        cmdbufferrd = FT_Register_Read(REG_CMD_READ);       // Read the graphics processor read pointer.
    	cmdbufferwr = FT_Register_Read(REG_CMD_WRITE); 	    // Read the graphics processor write pointer.
        
        return (4096 - 4) - ((cmdbufferwr - cmdbufferrd) & 4095);
    #elif defined EVE_FT810
        return FT_Register_Read(REG_CMDB_SPACE);
    #endif
}

/*******************************************************************************
* Function Name: FT_Write_ByteArray_4
********************************************************************************
*
* Summary:
*  Send an array of bytes to FT chip.
*  Used when bytes to be sent have to be multiple of four but possibly they 
*  are not.
*  This functions, if the array to be send is not multiple of 4; sends 0 bytes
*  until it is multiple.
*
* Parameters:
*  data:    pointer to array of bytes to be sent.
*  length:  length of the array.
*
* Return:
*  none
*
*******************************************************************************/
void FT_Write_ByteArray_4(const uint8 *data, uint32 length)
{
    FT_Send_ByteArray(data, length);
    ramCMDOffset += length; CheckCMDOffset();           // Manage offset to FT RAM.
    
    while ((ramCMDOffset % 4) != 0)
    {
        FT_Send_Byte(0);
        ramCMDOffset++; CheckCMDOffset();               // Manage offset to FT RAM.
    }
}

/*******************************************************************************
* Function Name: FT_ListStart
********************************************************************************
*
* Summary:
*  Starts a new list. 
*  Can be a DISPLAY list or a COPROCCESSOR list.
*
* Parameters:
*  listtype:    list to start, DISPLAY or COPROCCESOR
*
* Return:
*  Type of error:   OK, if it is ok.
*                   LIST_IN_PROGRESS, if a list has been started previouslly and
*                                     not finished.
*                   UNKNOWN_LIST_TYPE, if value of 'listtype' is unknown.
*
*******************************************************************************/
FTERROR FT_ListStart(TRANSFERTYPE transfertype)
{
    if (transferinprogress != NONE) return LIST_IN_PROGRESS;
    
    /* Wait until the coproccesor is ready. It have finished proccesing 
    previous commands. */
    
    while (!FTIsCoproReady(&ramCMDOffset)) {}
        
    #if defined EVE_FT800
        FT_Transfer_Start((RAM_CMD + ramCMDOffset) | MEMORY_WRITE);    // Start the display list
    #elif defined EVE_FT810
        FT_Transfer_Start(REG_CMDB_WRITE | MEMORY_WRITE);
    #endif
    
    if (transfertype == DLIST)
    {
        FT_Send_UINT32(CMD_DLSTART);
        
        #if defined EVE_FT800
            ramCMDOffset += 4; CheckCMDOffset();        // Manage offset to FT RAM.
        #endif
        
        transferinprogress = DLIST;
    } 
    else if (transfertype == DATA)
    {
        transferinprogress = DATA;
    }
    
    return OK;
}

/*******************************************************************************
* Function Name: FT_ListEnd
********************************************************************************
*
* Summary:
*  Finish a list that is in progress.
*
* Parameters:
*  swap:    if = 1, then sends command CMD_SWAP.
*           if = 0, do not send command CMD_SWAP.
*      Sending CMD_SWAP is the usual way of finishing a coproccesor list, but 
*  sometimes we can not send CMD_SWAP command because the command sent 
*  previously to FT chip can not work properly (ex: CMD_SPINNER).
*  This has no effect if the list in progress is a DISPLAY list.
*
* Return:
*  Type of error:   OK, there is no error.
*                   LIST_NOT_IN_PROGRESS, trying to finish a list that has not
*                                         been started.
*******************************************************************************/
FTERROR FT_ListEnd(SWAPACTION swap)
{
    if (transferinprogress == NONE) return LIST_NOT_IN_PROGRESS;
    
    if (swap == END_DL_SWAP)
    {
        #if defined EVE_FT800
            FT_Send_UINT32(DL_DISPLAY); 
            ramCMDOffset += 4; CheckCMDOffset();        // Manage offset to FT RAM.
            FT_Send_UINT32(CMD_SWAP); 
            ramCMDOffset += 4; CheckCMDOffset();        // Manage offset to FT RAM.

        #elif defined EVE_FT810          
            FT_Send_UINT32(DL_DISPLAY);
            FT_Send_UINT32(CMD_SWAP);
        #endif
    }
    
    FT_Transfer_End();
    
    #if defined EVE_FT800
        FT_Register_Write(REG_CMD_WRITE, ramCMDOffset);
    #endif

    transferinprogress = NONE;
    
    return OK;
}

/*******************************************************************************
* Function Name: DLListNewItem
********************************************************************************
*
* Summary:
*  Put new item (new command) inside current display list.
*  If current list is a DISPLAY list,  pointer to FT ram is not incremented in 
*  software. It is incremnted inside FT chip.
*  If current list is a COPROCCESOR list, it takes care of pointer offset.
*
* Parameters:
*  item:    command to be inserted in the list.
*
* Return:
*  none
*
*******************************************************************************/
void DLListNewItem(uint32 item)
{
    #if defined EVE_FT800
        FT_Send_ByteArray((uint8*)&item, 4);
        ramCMDOffset += 4; CheckCMDOffset();
    #elif defined EVE_FT810
        FT_Send_ByteArray((uint8*)&item, 4);        
    #endif
}

