s3ptar/HomeServer/Firmware/Cypress/PSoC_Eve-master/PSoC_Eve-master/PSoC_Eve_Library/PSoCEve_List.c
/*******************************************************************************
* Function Name: CMDListNewItem
********************************************************************************
*
* Summary:
*  Put new item inside current coproccesor list.
*
* Parameters:
*  tobesent:    pointer to the item to be sent to FT chip.
*  length:      length (in bytes) to be sent.
*  string:      for commands with strings (like CMD_BUTTON or CMD_TEXT) this is
*               a pointer to the string. For command that don´t use strings this
*               have to take value 0.
*
* Return:
*  none
*
*******************************************************************************/
void CMDListNewItem(uint8 *tobesent, uint8 length, unsigned char *string)
{
    unsigned char *cptr = string;
    
    #if defined EVE_FT810
        unsigned char charcounter = 0;
    #endif    
    
    #if defined EVE_FT800
        FT_Send_ByteArray(tobesent, length);                // Send all command parameters. 
        ramCMDOffset += length; CheckCMDOffset();           // Manage offset to FT RAM. 
        
        // Send the string if pointer to string is not zero.
        if (string != 0)                            
        {
            // Last byte of the string to be sent have to be equal to 0.
            // So, send bytes until we find byte = 0. 
            while (*cptr != 0)
            {
                FT_Send_Byte(*cptr);
                ramCMDOffset++;  CheckCMDOffset();          // Manage offset to FT RAM.
                cptr++;
            } 
        
            // Send last byte (byte = 0) to FT chip.
            FT_Send_Byte(0);
            ramCMDOffset++; CheckCMDOffset();               // Manage offset to FT RAM.
        
            // Every time we send a string to FT chip, its lenght have be multiple of 4.
            // If the length of the string is shorter than that, the we send 0 bytes until it is
            // a multiple of 4.
            while ((ramCMDOffset % 4) != 0)
            {
                FT_Send_Byte(0);
                ramCMDOffset++; CheckCMDOffset();           // Manage offset to FT RAM.
            }
        }
    #elif defined EVE_FT810
    
        FT_Send_ByteArray(tobesent, length);
        
        // Send the string if pointer to string is not zero.
        if (string != 0)                            
        {
            // Last byte of the string to be sent have to be equal to 0.
            // So, send bytes until we find byte = 0. 
            while (*cptr != 0)
            {
                FT_Send_Byte(*cptr);
                charcounter++;
                cptr++;
            } 
        
            // Send last byte (byte = 0) to FT chip.
            FT_Send_Byte(0);
            charcounter++;
        
            // Every time we send a string to FT chip, its lenght have be multiple of 4.
            // If the length of the string is shorter than that, the we send 0 bytes until it is
            // a multiple of 4.
            while ((charcounter % 4) != 0)
            {
                FT_Send_Byte(0);
                charcounter++;
            }
        }        
    #endif
  
}

FTERROR FT_InflateFromFlash(const uint8 *flashptr, uint32 ramgptr, uint32 size)
{
    uint16 readblocksize, cmdfree;
    
    if (transferinprogress != NONE) return LIST_IN_PROGRESS;
    
    /* *** Send cmd_loadimage command. *** */
    #if defined EVE_FT800
        FT_Transfer_Start((RAM_CMD + ramCMDOffset) | MEMORY_WRITE);    // Start the display list
    #elif defined EVE_FT810
        FT_Transfer_Start(REG_CMDB_WRITE | MEMORY_WRITE);
    #endif

    CMDInflate(ramgptr);
    FT_Transfer_End();    
    
    /* *** Send image data. *** */
    while (size > 0)
    {
        cmdfree = FTGetCMDFifoFreeSpace();
        
        if (size >= cmdfree) readblocksize = cmdfree;
        else readblocksize = size;
        
        #if defined EVE_FT800
            FT_Transfer_Start((RAM_CMD + ramCMDOffset) | MEMORY_WRITE);
        #elif defined EVE_FT810
            FT_Transfer_Start(REG_CMDB_WRITE | MEMORY_WRITE);
        #endif

        FT_Send_ByteArray(flashptr, readblocksize);
        
        flashptr += readblocksize;
        size -= readblocksize;
        
        FT_Transfer_End();

        #if defined EVE_FT800
            FT_Register_Write(REG_CMD_WRITE, ramCMDOffset);
        #endif
        
        while (!FTIsCoproccesorReady()){};
    }     
    
    return OK;    
}

FTERROR FT_InflateFromExternalFlash(uint32 flashptr, uint32 ramgptr, uint32 size)
{
    uint8 rbuffer[512];
    uint16 readblocksize, cmdfree;
    
    if (transferinprogress != NONE) return LIST_IN_PROGRESS;    
    
    /* *** Send cmd_loadimage command. *** */
    #if defined EVE_FT800
        FT_Transfer_Start((RAM_CMD + ramCMDOffset) | MEMORY_WRITE);    // Start the display list
    #elif defined EVE_FT810
        FT_Transfer_Start(REG_CMDB_WRITE | MEMORY_WRITE);
    #endif

    CMDInflate(ramgptr);
    FT_Transfer_End();
    
    #if defined EVE_FT800
        FT_Register_Write(REG_CMD_WRITE, ramCMDOffset);
    #endif
    
    /* *** Send image data. *** */
    while (size > 0)
    {
        if (size >= 512) readblocksize = 512;
        else readblocksize = size;
        
        cmdfree = FTGetCMDFifoFreeSpace();
        
        while (cmdfree < readblocksize) 
        {
            cmdfree = FTGetCMDFifoFreeSpace();
        }
        
        //SST25ReadArray(flashptr, rbuffer, readblocksize);
        
        #if defined EVE_FT800
            FT_Transfer_Start((RAM_CMD + ramCMDOffset) | MEMORY_WRITE);
        #elif defined EVE_FT810
            FT_Transfer_Start(REG_CMDB_WRITE | MEMORY_WRITE);
        #endif

        FT_Send_ByteArray(rbuffer, readblocksize);
        
        flashptr += readblocksize;
        size -= readblocksize;
        
        FT_Transfer_End();

        #if defined EVE_FT800
            FT_Register_Write(REG_CMD_WRITE, ramCMDOffset);
        #endif
        
        while (!FTIsCoproccesorReady()){};
    }     
    
    return OK;
}

FTERROR FT_LoadImageFromExternalFlash(uint32 flashptr, uint32 ramgptr, uint32 size, uint16 options)
{
    uint8 rbuffer[512];
    uint16 readblocksize, cmdfree;
    
    if (transferinprogress != NONE) return LIST_IN_PROGRESS;    
    
