s3ptar/HomeServer/Firmware/Cypress/PSoC_Eve-master/PSoC_Eve-master/PSoC_Eve_Library/PSoCEve_List.c
    /* *** Send cmd_loadimage command. *** */
    #if defined EVE_FT800
        FT_Transfer_Start((RAM_CMD + ramCMDOffset) | MEMORY_WRITE);    // Start the display list
    #elif defined EVE_FT810
        FT_Transfer_Start(REG_CMDB_WRITE | MEMORY_WRITE);
    #endif

    CMDLoadImage(ramgptr, options);
    FT_Transfer_End();
    
    #if defined EVE_FT800
        FT_Register_Write(REG_CMD_WRITE, ramCMDOffset);
    #endif
    
    /* *** Send image data. *** */
    while (size > 0)
    {
        if (size >= 512) readblocksize = 512;
        else readblocksize = size;
        
        cmdfree = FTGetCMDFifoFreeSpace();
        
        while (cmdfree < readblocksize) {};
        
        //SST25ReadArray(flashptr, rbuffer, readblocksize);
        
        #if defined EVE_FT800
            FT_Transfer_Start((RAM_CMD + ramCMDOffset) | MEMORY_WRITE);
        #elif defined EVE_FT810
            FT_Transfer_Start(REG_CMDB_WRITE | MEMORY_WRITE);
        #endif

        FT_Send_ByteArray(rbuffer, readblocksize);
        
        flashptr += readblocksize;
        size -= readblocksize;
        
        FT_Transfer_End();

        #if defined EVE_FT800
            FT_Register_Write(REG_CMD_WRITE, ramCMDOffset);
        #endif
        
        while (!FTIsCoproccesorReady()){};
    }     
    
    return OK;
}

FTERROR FT_TransferToRAMG(uint32 flashptr, uint32 size)
{
    uint8 rbuffer[512];
    uint16 readblocksize;
    
    if (transferinprogress != NONE) return LIST_IN_PROGRESS;    
    
    /* *** Send image data. *** */
    while (size > 0)
    {
        if (size >= 512) readblocksize = 512;
        else readblocksize = size;
        
       // SST25ReadArray(flashptr, rbuffer, readblocksize);
        
        FT_Transfer_Start((RAM_G + flashptr) | MEMORY_WRITE);
        FT_Send_ByteArray(rbuffer, readblocksize);
        FT_Transfer_End();
        
        flashptr += readblocksize;
        size -= readblocksize;

    }     
    
    return OK;
}

void DLBitmapSource(uint32 address)
{
    DLListNewItem(_DLBitmapSource(address));
}

void DLClearColorRGB(uint8 red, uint8 green, uint8 blue)
{
    DLListNewItem(_DLClearColorRGB(red, green, blue));
}

void DLTag(uint8 tag)
{
    DLListNewItem(_DLTag(tag));
}

void DLColorRGB(uint8 red, uint8 green, uint8 blue)
{
    DLListNewItem(_DLColorRGB(red, green, blue));
}

void DLBitmapHandle(uint8 handle)
{
    DLListNewItem(_DLBitmapHandle(handle));
}

void DLCell(uint8 cell)
{
    DLListNewItem(_DLCell(cell));
}

void DLBitmapLayout(uint8 format, uint16 linestride, uint16 height)
{
    DLListNewItem(_DLBitmapLayout(format, linestride, height));
    
    #if defined EVE_FT810
        DLListNewItem(_DLBitmapLayout_H(linestride, height));
    #endif 
}

void DLBitmapSize(uint8 filter, uint8 wrapx, uint8 wrapy, uint16 width, uint16 height)
{
    DLListNewItem(_DLBitmapSize(filter, wrapx, wrapy, width, height));
    
    #if defined EVE_FT810
        DLListNewItem(_DLBitmapSize_H(width, height));
    #endif 
}

void DLAlphaFunc(uint8 func, uint8 ref)
{
    DLListNewItem(_DLAlphaFunc(func, ref));
}

void DLStencilFunc(uint8 func, uint8 ref, uint8 mask)
{
    DLListNewItem(_DLStencilFunc(func, ref, mask));
}

void DLBlendFunc(uint8 src, uint8 dst)
{
    DLListNewItem(_DLBlendFunc(src, dst));
}

void DLStencilOp(uint8 sfail, uint8 spass)
{
    DLListNewItem(_DLStencilOp(sfail, spass));
}

void DLPointSize(uint32 size)
{
    DLListNewItem(_DLPointSize(size));
}

void DLLineWidth(uint16 width)
{
    DLListNewItem(_DLLineWidth(width));
}

void DLColorA(uint8 alpha)
{
    DLListNewItem(_DLColorA(alpha));
}

void DLClearStencil(uint8 s)
{
    DLListNewItem(_DLClearStencil(s));
}

void DLClearTag(uint8 t)
{
    DLListNewItem(_DLClearTag(t));
}

void DLStencilMask(uint8 mask)
{
    DLListNewItem(_DLStencilMask(mask));
}

void DLTagMask(uint8 mask)
{
    DLListNewItem(_DLTagMask(mask));
}

void DLBitmapTransformA(uint32 a)
{
    DLListNewItem(_DLBitmapTransformA(a));
}

void DLBitmapTransformB(uint32 b)
{
    DLListNewItem(_DLBitmapTransformB(b));
}

void DLBitmapTransformC(uint32 c)
{
    DLListNewItem(_DLBitmapTransformC(c));
}

void DLBitmapTransformD(uint32 d)
{
    DLListNewItem(_DLBitmapTransformD(d));
}

void DLBitmapTransformE(uint32 e)
{
    DLListNewItem(_DLBitmapTransformE(e));
}

void DLBitmapTransformF(uint32 f)
{
    DLListNewItem(_DLBitmapTransformF(f));
}

void DLScissorXY(uint16 x, uint16 y)
{
    DLListNewItem(_DLScissorXY(x, y));
}

void DLScissorSize(uint16 width, uint16 height)
{
    DLListNewItem(_DLScissorSize(width, height));
}

void DLJump(uint16 address)
{
    DLListNewItem(_DLJump(address));
}

void DLBegin(uint8 primitive)
{
    DLListNewItem(_DLBegin(primitive));
}

void DLCall(uint16 address)
{
    DLListNewItem(_DLCall(address));
}

void DLColorMask(uint8 r, uint8 g, uint8 b, uint8 a)
{
    DLListNewItem(_DLColorMask(r, g, b, a));
}

void DLEnd()
{
    DLListNewItem(_DLEnd());
}

void DLSaveContext()
{
    DLListNewItem(_DLSaveContext());
}

void DLRestoreContext()
{
    DLListNewItem(_DLRestoreContext());
}

void DLReturn()
{
    DLListNewItem(_DLReturn());
}

void DLMacro(uint8 macro)
{
    DLListNewItem(_DLMacro(macro));
}

void DLClear(uint8 color, uint8 stencil, uint8 tag)
{
    DLListNewItem(_DLClear(color, stencil, tag));
}

void DLVertex2F(int16 x, int16 y)
{
    DLListNewItem(_DLVertex2F(x, y));
}

void DLVertex2II(uint16 x, uint16 y, uint8 handle, uint8 cell)
{
    DLListNewItem(_DLVertex2II(x, y, handle, cell));
}

/* ************************************************************************** */
/* ************************************************************************** */
void DLVertexFormat(uint8 format)
{
    #if defined EVE_FT800
        vertexFormat = format;
    #endif
    
    #if defined EVE_FT810
        DLListNewItem(_DLVertexFormat(format));
    #endif
}

#if defined EVE_FT810
    
    void DLPaletteSource(uint32 address)
    {
        DLListNewItem(_DLPaletteSource(address));
    }
    
    void DLVertexTranslateX(int32 translation)
    {
        DLListNewItem(_DLVertexTranslateX(translation));
    }
    
    void DLVertexTranslateY(int32 translation)
    {
        DLListNewItem(_DLVertexTranslateY(translation));
    }
    
    void DLNop()
    {
        DLListNewItem(_DLNop());
    }
    
#endif  








void CMDDLStart()
{
    CMDListNewItem(_CMDDLStart());
}

void CMDSwap()
{
    CMDListNewItem(_CMDSwap());
}

void CMDInterrupt(uint32 milliseconds)
{
    CMDListNewItem(_CMDInterrupt(milliseconds));
}

void CMDBgcolor(int8 red, int8 green, int8 blue)
{
    CMDListNewItem(_CMDBgcolor(red, green, blue));
}

void CMDFgcolor(int8 red, int8 green, int8 blue)
{
    CMDListNewItem(_CMDFgcolor(red, green, blue));
}

void CMDGradient(int16 x0, int16 y0, int8 red0, int8 green0, int8 blue0, int16 x1, int16 y1, int8 red1, int8 green1, int8 blue1)
{
    CMDListNewItem(_CMDGradient(x0, y0, red0, green0, blue0, x1, y1, red1, green1, blue1));
}

