s3ptar/HomeServer/Firmware/Cypress/PSoC_Eve-master/PSoC_Eve-master/PSoC_Eve_Library/PSoCEve_List.c
void CMDText(int16 x, int16 y, int16 font, int16 options, char* text)
{
    CMDListNewItem(_CMDTextNew(x, y, font, options, text));
}

void CMDButton(int16 x, int16 y, int16 width, int16 height, int16 font, int16 options, char* text)
{
    CMDListNewItem(_CMDButton(x, y, width, height, font, options, text));
}

void CMDKeys(int16 x, int16 y, int16 width, int16 height, int16 font, int16 options, char* text)
{
    CMDListNewItem(_CMDKeys(x, y, width, height, font, options, text));
}

void CMDProgressBar(int16 x, int16 y, int16 width, int16 height, int16 options, int16 value, int16 range)
{
    CMDListNewItem(_CMDProgressBar(x, y, width, height, options, value, range));
}

void CMDSlider(int16 x, int16 y, int16 width, int16 height, int16 options, int16 value, int16 range)
{
    CMDListNewItem(_CMDSlider(x, y, width, height, options, value, range));
}

void CMDScrollBar(int16 x, int16 y, int16 width, int16 height, int16 options, int16 value, int16 size, int16 range)
{
    CMDListNewItem(_CMDScrollBar(x, y, width, height, options, value, size, range));
}

void CMDToggle(int16 x, int16 y, int16 width,int16 font, int16 options, int16 state, char* text)
{
    CMDListNewItem(_CMDToggle(x, y, width, font, options, state, text));
}

void CMDGauge(int16 x, int16 y, int16 radius, int16 options, int16 major, int16 minor, int16 value, int16 range)
{
    CMDListNewItem(_CMDGauge(x, y, radius, options, major, minor, value, range));
}

void CMDClock(int16 x, int16 y, int16 radius, int16 options, int16 hours, int16 minutes, int16 seconds, int16 milliseconds)
{
    CMDListNewItem(_CMDClock(x, y, radius, options, hours, minutes, seconds, milliseconds));
}

void CMDCalibrate()
{
    CMDListNewItem(_CMDCalibrate());
}

void CMDSpinner(int16 x, int16 y, int16 style, int16 scale)
{
    CMDListNewItem(_CMDSpinner(x, y, style, scale)); 
}

void CMDStop()
{
    CMDListNewItem(_CMDStop());
}

void CMDMemWrite(int32 ptr, int32 size)
{
    CMDListNewItem(_CMDMemWrite(ptr, size));
}

void CMDMemSet(int32 ptr, int32 value, int32 size)
{
    CMDListNewItem(_CMDMemSet(ptr, value, size));
}

void CMDMemZero(int32 ptr, int32 size)
{
    CMDListNewItem(_CMDMemZero(ptr, size));
}

void CMDMemCopy(int32 dest, int32 src, int32 size)
{
    CMDListNewItem(_CMDMemCopy(dest, src, size));
}

void CMDAppend(int32 ptr, int32 size)
{
    CMDListNewItem(_CMDAppend(ptr, size));
}

void CMDSnapshot(int32 ptr)
{
    CMDListNewItem(_CMDSnapshot(ptr));
}

void CMDInflate(int32 ptr)
{
    CMDListNewItem(_CMDInflate(ptr));
}

int32 CMDGetPtr()
{
    uint16 cmdptr = FT_Register_Read(REG_CMD_WRITE);

    FT_ListStart(DATA);
        CMDListNewItem(_CMDGETPTR(0));
    FT_ListEnd(END_DL_NOSWAP);
    
    return FT_Read_UINT32(RAM_CMD + cmdptr + 4);
}

void CMDLoadImage(int32 ptr, int32 options)
{
    #if defined EVE_FT800
        FT_Transfer_Start((RAM_CMD + ramCMDOffset) | MEMORY_WRITE);    // Start the display list
    #elif defined EVE_FT810
        FT_Transfer_Start(REG_CMDB_WRITE | MEMORY_WRITE);
    #endif

    CMDListNewItem(_CMDLoadImage(ptr, options));
    FT_Transfer_End();
    
    #if defined EVE_FT800
        FT_Register_Write(REG_CMD_WRITE, ramCMDOffset);
    #endif
}

void CMDLoadImage_Data(uint8* data, uint32 datalength, uint8 isend)
{
    uint16 cmdfree;
    
    cmdfree = FTGetCMDFifoFreeSpace();
    while (cmdfree < datalength) {};
        
    #if defined EVE_FT800
        FT_Transfer_Start((RAM_CMD + ramCMDOffset) | MEMORY_WRITE);
    #elif defined EVE_FT810
        FT_Transfer_Start(REG_CMDB_WRITE | MEMORY_WRITE);
    #endif
    
    if (isend) FT_Write_ByteArray_4(data, datalength);
    else 
    {
        FT_Send_ByteArray(data, datalength);
        ramCMDOffset += datalength; CheckCMDOffset();
    }
        
    FT_Transfer_End();

    #if defined EVE_FT800
        FT_Register_Write(REG_CMD_WRITE, ramCMDOffset);
    #endif
    
    while (!FTIsCoproccesorReady()){};
}

void CMDGetProps(int32 ptr, int32* width, int32* height)
{
    uint16 cmdptr = FT_Register_Read(REG_CMD_WRITE);
    
    FT_ListStart(DATA);
        CMDListNewItem(_CMDGETPROPS(ptr, 0, 0));
    FT_ListEnd(END_DL_SWAP);
    
    *width = FT_Read_UINT32(RAM_CMD + cmdptr + 8);
    *height = FT_Read_UINT32(RAM_CMD + cmdptr + 12);
}

void CMDLoadIdentity()
{
    CMDListNewItem(_CMDLoadIdentity());
}

void CMDTranslate(int32 tx, int32 ty)
{
    CMDListNewItem(_CMDTranslate(tx, ty));
}

void CMDScale(int32 x, int32 y)
{
    CMDListNewItem(_CMDScale(x, y));
}

void CMDRotate(int32 angle)
{
    CMDListNewItem(_CMDRotate(angle));
}

void CMDSetmatrix()
{
    CMDListNewItem(_CMDSetmatrix());
}

void CMDSetfont(int32 font, int32 ptr)
{
    CMDListNewItem(_CMDSetfont(font, ptr));
}

void CMDTrack(int16 x, int16 y, int16 width, int16 height, int16 tag)
{
    CMDListNewItem(_CMDTrack(x, y, width, height, tag));
}

void CMDDial(int16 x, int16 y, int16 radius, int16 options, int16 value)
{
    CMDListNewItem(_CMDDial(x, y, radius, options, value));
}

void CMDNumber(int16 x, int16 y, int16 font, int16 options, int32 number)
{
    CMDListNewItem(_CMDNumber(x, y, font, options, number));
}

void CMDScreenSaver()
{
    CMDListNewItem(_CMDScreenSaver());
}

void CMDSketch(int16 x, int16 y, int16 width, int16 height, int32 ptr, int16 format)
{
    CMDListNewItem(_CMDSketch(x, y, width, height, ptr, format));
}

void CMDLogo()
{
    CMDListNewItem(_CMDLogo());
}

void CMDColdstart()
{
    CMDListNewItem(_CMDColdstart());
}

void CMDGradcolor(int8 red, int8 green, int8 blue)
{
    CMDListNewItem(_CMDGradcolor(red, green, blue));
}

/* ************************************************************************** */
/* ************************************************************************** */
void CMDSetBitmap(int32 address, int16 format, int16 width, int16 height)
{
    #if defined EVE_FT800
        DLBitmapSource(address);
        
        switch(format)
        {
            case BITMAP_LAYOUT_ARGB1555: DLBitmapLayout(format, width << 1, height); break;
            case BITMAP_LAYOUT_L1: DLBitmapLayout(format, width, height); break;
            case BITMAP_LAYOUT_L4: DLBitmapLayout(format, width >> 1, height); break;
            case BITMAP_LAYOUT_L8: DLBitmapLayout(format, width, height); break;
            case BITMAP_LAYOUT_RGB332: DLBitmapLayout(format, width, height); break;
            case BITMAP_LAYOUT_ARGB2: DLBitmapLayout(format, width, height); break;
            case BITMAP_LAYOUT_ARGB4: DLBitmapLayout(format, width << 1, height); break;
            case BITMAP_LAYOUT_RGB565: DLBitmapLayout(format, width << 1, height); break;
        }
        
        DLBitmapSize(BITMAP_SIZE_FILTER_NEAREST, BITMAP_SIZE_WRAP_BORDER, BITMAP_SIZE_WRAP_BORDER, width, height);
    #endif
    
    #if defined EVE_FT810
        //CMDListNewItem(_CMDSetBitmap(address, format, width, height));
        
        DLBitmapSource(address);
        
        switch(format)
        {
            case BITMAP_LAYOUT_ARGB1555: DLBitmapLayout(format, width << 1, height); break;
            case BITMAP_LAYOUT_L1: DLBitmapLayout(format, width, height); break;
            case BITMAP_LAYOUT_L2: DLBitmapLayout(format, width >> 2, height); break;
            case BITMAP_LAYOUT_L4: DLBitmapLayout(format, width >> 1, height); break;
            case BITMAP_LAYOUT_L8: DLBitmapLayout(format, width, height); break;
            case BITMAP_LAYOUT_RGB332: DLBitmapLayout(format, width, height); break;
            case BITMAP_LAYOUT_ARGB2: DLBitmapLayout(format, width, height); break;
            case BITMAP_LAYOUT_ARGB4: DLBitmapLayout(format, width << 1, height); break;
            case BITMAP_LAYOUT_RGB565: DLBitmapLayout(format, width << 1, height); break;
        }
        
        DLBitmapSize(BITMAP_SIZE_FILTER_NEAREST, BITMAP_SIZE_WRAP_BORDER, BITMAP_SIZE_WRAP_BORDER, width, height);        
    #endif
}
    
#if defined EVE_FT810
    
    void CMDSetRotate(int32 rotation)
    {
        CMDListNewItem(_CMDSETROTATE(rotation));
    }
    
    void CMDSetBase(int32 base)
    {
        CMDListNewItem(_CMDSETBASE(base));
    }
    
    void CMDSetfont2(int32 font, int32 ptr, int32 firstchar)
    {
        CMDListNewItem(_CMDSETFONT2(font, ptr, firstchar));
    }
    
    void CMDRomfont(int32 handle, int32 font)
    {
        CMDListNewItem(_CMDROMFONT(handle, font));
    }

#endif    


/* [] END OF FILE */
